<?php

return [
    'welcome' => 'مرحبًا بك في تطبيقنا!',
    'login_success' => 'تم تسجيل الدخول بنجاح',
    'logout_success' => 'تم تسجيل الخروج بنجاح',
    'login_failed' => 'بيانات الدخول غير صحيحة',
    'account_disabled' => 'تم تعطيل حسابك، يرجى التواصل مع الدعم',
    'register_success' => 'تم التسجيل بنجاح',
    'token-refreshed' => 'تم تحديث التوكن',
    'user-update' => 'تم تحديث الملف الشخصي بنجاح',
    'tooManyAttempts' => 'تم تجاوز الحد الأقصى للمحاولات، يرجى المحاولة لاحقًا.',
    'notEnoughCoins' => 'ليس لديك رصيد كافي من النقاط',
    'minimumDollar1' => 'يجب أن تسحب على الأقل $',
    'minimumDollar2' => ' من الرصيد!',
    'successfullyWithdraw' => 'تم إرسال طلب السحب بنجاح!',
    'bounce_code' => 'تهانينا , لقد حصلت على النقاط و تمت إضافتها لرصيدك .',
    'expaired_code' => 'انتهت صلاحية الكود, تم الوصول للعدد المطلوب من المستخدين',
    'send_email_forget_password' => 'لقد أرسلنا لك بريد الكتروني يحتوي على كود التحقق لإعادة تعيين كلمة المرور, تفقد صندوق بريدك. ',
    'verification_code_expired' => 'انتهت صلاحية كود التحقق ,اطلب كود جديد من فضلك.',
    'reset_password_successfully' => 'تم إعادة تعيين كلمة مرورك بنجاح , يمكنك اعادة تسجل الدخول'
];
