<?php
return [
    'custom' => [
        'email' => [
            'required' => 'حقل البريد الإلكتروني مطلوب.',
            'email' => 'يجب أن يكون البريد الإلكتروني صالحًا.',
            'min' => 'يجب أن يحتوي البريد الإلكتروني على الأقل :min أحرف.',
            'confirmed' => 'تأكيد البريد الإلكتروني غير متطابق.',
            'exists' => 'البريد الإلكتروني غير مسجل.',
        ],
        'password' => [
            'required' => 'حقل كلمة المرور مطلوب.',
            'string' => 'يجب أن تكون كلمة المرور نصًا.',
            'min' => 'يجب أن تتكون كلمة المرور من :min أحرف على الأقل.',
            'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        ],
        'verification_code' => [
            'required' => 'حقل كود التحقق مطلوب.',
            'string' => 'يجب أن يكون كود التحقق نصيًا.',
            'exists' => 'كود التحقق غير صالح أو منتهي الصلاحية.',
        ],
        'phone' => [
            'required' => 'حقل رقم الموبايل مطلوب.',
            'min' => 'يجب أن يحتوي رقم الموبايل على الأقل :min أرقام.',
            'max' =>  'يجب أن لا يتجاوز رقم الموبايل  :max أرقام.',
        ],
        'question' => [
            'required' => 'حقل السؤال مطلوب.',
            'min' => 'يجب أن يحتوي السؤال على الأقل :min أحرف.',
            'max' =>  'يجب أن لا يتجاوز السؤال  :max أحرف.',
        ],
    ],
];
